<!-- pipecd-plan-preview-->
[![PLAN_PREVIEW](https://img.shields.io/static/v1?label=PipeCD&message=Plan_Preview&color=success&style=flat)](https://pipecd.dev/docs/user-guide/plan-preview/) [![ACTIONS](https://img.shields.io/static/v1?label=PipeCD&message=Action_Log&style=flat)](https://github.com/pipe-cd/examples/actions/runs/2106841643)

Ran plan-preview against head commit 162666ed9ed462854eb5c529655c74a12cd3d3f8 of this pull request. PipeCD detected `2` updated applications and here are their plan results. Once this pull request got merged their deployments will be triggered to run as these estimations.

## app: [simple](https://play.pipecd.dev/applications/ece10473-0cdb-4fec-96a1-a3df8f2e3c6e), env: example, kind: terraform
Sync strategy: QUICK_SYNC
Summary: 1 to add, 0 to change, 1 to destroy

<details>
<summary>Details (Click me)</summary>
<p>

``` hcl
terraform init -no-color -var=project=pipecd-playground
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding latest version of hashicorp/google...
- Installing hashicorp/google v4.16.0...
- Installed hashicorp/google v4.16.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
terraform plan -lock=false -detailed-exitcode -no-color -var=project=pipecd-playgroundgoogle_storage_bucket_object.object: Refreshing state... [id=pipecd-play-terraform-examples-simple/default.txt]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_storage_bucket_object.object has changed
  ~ resource "google_storage_bucket_object" "object" {
        id               = "pipecd-play-terraform-examples-simple/default.txt"
      + metadata         = {}
        name             = "simple/default.txt"
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket_object.object must be replaced
-/+ resource "google_storage_bucket_object" "object" {
      ~ content          = (sensitive value) # forces replacement
      ~ content_type     = "text/plain; charset=utf-8" -> (known after apply)
      ~ crc32c           = "q/GYqQ==" -> (known after apply)
      ~ detect_md5hash   = "ydxEf1G60kRGWDL3ezAglg==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "pipecd-play-terraform-examples-simple/default.txt" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "ydxEf1G60kRGWDL3ezAglg==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/pipecd-play-terraform-examples/o/simple%2Fdefault.txt?generation=1648021023536090&alt=media" -> (known after apply)
      - metadata         = {} -> null
        name             = "simple/default.txt"
      ~ output_name      = "simple/default.txt" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/pipecd-play-terraform-examples/o/simple%2Fdefault.txt" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
1 to add, 0 to change, 1 to destroy

```
</p>
</details>

## app: [helm-remote-chart](https://play.pipecd.dev/applications/36347720-8f03-417d-8465-094f7d4eb4b1), env: example, kind: kubernetes
Sync strategy: QUICK_SYNC
Summary: 0 added manifests, 2 changed manifests, 0 deleted manifests

<details>
<summary>Details (Click me)</summary>
<p>

``` diff
--- Last Deploy
+++ Head Commit

# 1. name="helm-remote-chart-helloworld", kind="Deployment", namespace="default", apiVersion="apps/v1"

@@ -5,8 +5,8 @@
     app.kubernetes.io/instance: helm-remote-chart
     app.kubernetes.io/managed-by: Helm
     app.kubernetes.io/name: helloworld
-    app.kubernetes.io/version: v0.11.0
-    helm.sh/chart: helloworld-v0.11.0
+    app.kubernetes.io/version: v0.27.1
+    helm.sh/chart: helloworld-v0.27.1
   name: helm-remote-chart-helloworld
 spec:
   replicas: 1
@@ -23,11 +23,11 @@
       containers:
       - args:
         - server
-        image: gcr.io/pipecd/helloworld:v0.11.0
+        image: gcr.io/pipecd/helloworld:v0.27.1
         imagePullPolicy: IfNotPresent
         livenessProbe:
           httpGet:
-            path: /
+            path: /healthz
             port: admin
         name: helloworld
         ports:
@@ -36,7 +36,7 @@
           protocol: TCP
         readinessProbe:
           httpGet:
-            path: /
+            path: /healthz
             port: admin
         resources: {}
         securityContext: {}
# 2. name="helm-remote-chart-helloworld", kind="Service", namespace="default", apiVersion="v1"

@@ -5,8 +5,8 @@
     app.kubernetes.io/instance: helm-remote-chart
     app.kubernetes.io/managed-by: Helm
     app.kubernetes.io/name: helloworld
-    app.kubernetes.io/version: v0.11.0
-    helm.sh/chart: helloworld-v0.11.0
+    app.kubernetes.io/version: v0.27.1
+    helm.sh/chart: helloworld-v0.27.1
   name: helm-remote-chart-helloworld
 spec:
   ports:


```
</p>
</details>
